Course 11: Wet-Dry World

		"name": "Shocking Arrow Lifts!",
		"notes": "In the yellow box near the Arrow Lifts.",

		"name": "Top o' the Town",
		"notes": "Across the wooden plank, in the yellow box on the highest floating island.",

		"name": "Secrets in the Shallows & Sky",
		"notes": "Find all 5 secret spots. One is behind the block that you push at the very bottom of the level, one is in the yellow box that you can get by standing on the block that you push at the very bottom of the level, one is behind the block you push into a hole near one of the Chuckyas, one is in the yellow box above the cage with the star in it, and one is in the yellow box on top of the small island that the bomb is spinning around.",

		"name": "Express Elevator - Hurry Up!",
		"notes": "In the cage up high. To get it, you need to lower the water level to the ground. Break the block at the bottom of the cage, climb up so you are on top of the cage with the star, and stand on the left half of the wooden platform. It will fall down. Jump off, run into the cage, and jump back on the platform before it goes up. Inside the cage.",

		"name": "Go to Town for the Red Coins",
		"notes": "Get all 8 Red Coins. Use the cannon to launch yourself into the grate in the corner of the level. Swim into the other section of this stage.",

		"name": "Quick Race Through Downtown!",
		"notes": "Use the cannon to launch yourself into the grate in the corner of the level, and swim to the other section of this stage. Use the Vanish Cap to get behind the grate near the corner of this section. There is another Vanish Cap inside the grate. Up top is the star. Use the ever-popular wall kick maneuver.",

		"name": "Get 100 Coins.",
		"notes": "",

Course 12: Tall, Tall Mountain

		"name": "Scale the Mountain",
		"notes": "At the very top of the mountain.",

		"name": "Mystery of the Monkey Cage",
		"notes": "Catch Ukkiki the Monkey at the very top of the mountain (where Star 1 was) and follow him. He will open the cage with the star.",

		"name": "Scary 'Shrooms, Red Coins",
		"notes": "Get all 8 Red Coins.",

		"name": "Mysterious Mountainside",
		"notes": "Near the top of the mountain, there will be a wall about the same size as the entrance to Course 8 that you can jump through. When you get near the wall, it will shake. It leads to another slide. Survive the ride all the way to the end for a star.",

		"name": "Breathtaking View from the Bridge",
		"notes": "Step on the ! switch near the top of the mountain. This will make a block appear in front of you, and one will appear in front of the waterfall. Go to the waterfall and jump on the block to get the star that is behind the water.",

		"name": "Blast to the Lonely Mushroom",
		"notes": "Use the cannon to shoot yourself into the star that is sitting on top of the mushroom platform. The cannon is on a thin ledge beneath the ledge where the Monty Moles are. The Bob-omb Buddy is on a small ledge below where Ukkiki is.",

		"name": "Get 100 Coins.",
		"notes": "",

Course 13: Tiny-Huge Island

		"name": "Pluck the Piranha Flower",
		"notes": "At the green pipe near the flat ! switch that makes a bridge out to the floating island. Make sure you are small. Kill the 5 Piranha Plants and you will get the star.",

		"name": "The Tip Top of the Huge Island",
		"notes": "In a yellow box almost at the very top of the mountain. You need to be small to get this.",

		"name": "Rematch with Koopa the Quick",
		"notes": "Just past the hole where the black balls roll out of, there is a Koopa the Quick, ready for a rematch. Be small and talk to him. Win the race and you will win a star.",

		"name": "Five Itty Bitty Secrets",
		"notes": "Find all 5 secret spots. You have to be big. One is on the cannon, one is in the hole where the balls roll out of, one is the inside of the hole where small Mario can run through to get to the pool, one is in the pool at the very top of the mountain, and one is the the hole in the mountain at the edge of the wooden bridge above the water.",

		"name": "Wiggler's Red Coins",
		"notes": "Be small. Launch yourself from the cannon at the tree. To find the Bob-omb Buddy, you need to be big and go to the place where the cannon is. When you catch the tree, climb down and walk across the wooden bridge and into the hole. Get all 8 Red Coins.",

		"name": "Make Wiggler Squirm",
		"notes": "Be big. Climb to the pool at the very top of the mountain and pound the center. You will create a hole. Go down and turn small, climb back up, go down the hole, and beat Wiggler.",

		"name": "Get 100 Coins.",
		"notes": "",

Course 14: Tick Tock Clock

		"name": "Roll into the Cage",
		"notes": "Climb up along the normal path, and you will see the star within some grating. You can jump onto the platforms nearby and get it. Clock may be stopped or moving for this star - easier when stopped.",

		"name": "The Pit and the Pendulums",
		"notes": "Climb up farther than star 1, and you will eventually come to a monster who will throw you up. Go past him and jump across the chasm. The star is just ahead. Clock may be stopped or moving for this star - easier when stopped.",

		"name": "Get a Hand",
		"notes": "Stand on the clock hand that looks like an arrow and let it swing you around. When you see the star in front of you, jump onto the ledge and get it. Clock must be moving for this star.",

		"name": "Stomp on the Thwomp",
		"notes": "Climb up to the very top of the stage. Swing around on the clock hand, and jump onto the Thwomp for the star. Clock must be moving for this star.",

		"name": "Timed Jumps on Moving Bars",
		"notes": "Climb up higher than star 1, but not as high as star 4. You will see the star in a cage. You need to stand on top of the cage, then jump onto the platform that comes in and out of the wall to get the star.",

		"name": "Stop Time for Red Coins",
		"notes": "Get all 8 Red Coins. Clock may be stopped or moving for this star - easier when stopped.",

		"name": "Get 100 Coins.",

Course 15: Rainbow Ride

		"name": "Cruiser Crossing the Rainbow",
		"notes": "On one end of the pirate ship.",

		"name": "The Big House in the Sky",
		"notes": "Ride the carpets up as high as you can go (you will pass through the castle in the sky twice). The star is on top of of the castle in the sky.",

		"name": "Coins Amassed in a Maze",
		"notes": "Get all 8 Red Coins.",

		"name": "Swingin' in the Breeze",
		"notes": "From the section where there are 4 spinning discs, go towards the tilting bridges and the platforms that swing back and forth. Go across one of the swinging platforms and you should see a flat ! switch on the ground near some triangular blocks. Step on it and the blocks will turn upside down so you can jump on them temporarily. Climb up them for the star.",

		"name": "Tricky Triangles",
		"notes": "From the section where there are 4 spinning discs, go towards the tilting bridges and the platforms that swing back and forth. Climb up the steep wood slope, and go across the swinging platform to get the star.",

		"name": "Somewhere over the Rainbow",
		"notes": "Launch yourself from the cannon so you catch the large pole coming from the island in the sky. Climb down and the star is in the yellow box. The cannon is on the opposite side of the pirate ship as star 1. To find the Bob-omb Buddy, you need to get on top of the building where all the Red Coins are, and jump down 1 ledge. The best way to get on top of the building where all the Red Coins are is to take the carpet near the 4 spinning discs, and then when it ends, take the carpet on the right. You will jump off it onto the falling wooden blocks, then jump back on it, then jump off it again onto the falling wooden blocks, then back onto it again. You should now be over the building, so you can get off the carpet. There is a yellow box on top of the building for reference.",

		"name": "Get 100 Coins.",
		"notes": "",

Secret stars


Bowser Courses


    "name": "Bowser in the Dark World",
    "notes": "Get all 8 red coins.",

		"name": "Bowser in the Fire Sea",
		"notes": "Get all 8 red coins.",

		"name": "Bowser in the Sky",
		"notes": "Get all 8 red coins.",


    Switch courses 

    "name": "Red ! Switch (Wing Cap)",
		"notes": "Get all 8 red coins.",

    
    "name": "Green ! Switch (Metal Cap)",
		"notes": "Get all 8 red coins.",

    "name": "Blue ! Switch (Vanish Cap)",
		"notes": "Get all 8 red coins.",

Castle Secret Stars

    Princess's Secret Slide - finish the race over 21 seconds.
    Princess's Secret Slide - finish the race under 21 seconds.
    The Secret Aquarium - get all 8 Red Coins.
    After you have 20 stars, catch the MIPS the Rabbit in the lower level of the castle where courses 6-8 are. He will give you a star.
    After you have 20 stars, talk to Toad who is in the room where you enter Course 6. He will give you a star.
    After you have 30 stars, in the upper level of the castle where Courses 10-13 are, Toad will give you a star if you talk to him.
    After you have 50 stars, catch MIPS the Rabbit again for another star.
    After you have 50 stars, in the room with courses 14 and 15, talk to Toad, and he will give you a star.
    Wing Mario over the Rainbow - get all 8 Red Coins.
