


"title": Plunder in the Sunken Ship
Wait until the giant eel swims out of the ship, then swim into the ship where he was and unlock the 4 chests. The correct order is: chest farthest from you, chest on your right, chest closest to you, and chest on your left.

"title": Can the Eel Come out to Play?
Swim next to the giant eel again. He will swim out; the star is on his tail.

"title": Treasure in the Ocean Cave
Swim through the tunnel near the ship. You will surface in a cave. Open the 4 chests. The correct order is: chest farthest from you, chest on your left, chest on your right, chest closest to you.

"title": Red Coins on the Ship Afloat
Get all 8 Red Coins.

"title": Blast to the Stone Pillar
Launch yourself out of the cannon onto the leftmost spike that extends out of the water. You have to hit the top of the spike, or Mario will slide down. Climb to the top of the spike and jump onto the ledge with the star.

"title": Through the Jet Stream
Get the Metal Cap and jump off the ledge into the water. Quickly run to the star underwater in the jet stream.

"title": Get 100 Coins.
Course 4: Cool, Cool Mountain

Location: Main floor of castle, left side, star with a 3 in it on the door - picture of snow and snowman.

"title": Slip Slidin' Away
Climb onto the house where you start and go down the chimney. Make it to the bottom of the slide to get the star. There is a shortcut on the right wall when it curves upward... just follow the string of coins into the wall.

"title": Li'l Penguin Lost
Pick up the baby penguin that you see when you start and carry it all the way down to the mama penguin. Put it down next to her and she will give you a star.

"title": Big Penguin Race
Go down the chimney again, and beat the big penguin to the end. If you use the shortcut, the penguin will say you cheated, and he won't give you the star.

"title": Frosty Slide for 8 Red Coins
Get all 8 Red Coins.

"title": Snowman's Lost His Head
Talk to the snowball at the TOP of the mountain. Beat it down the mountain and stand next to the snowball head. The rolling snowball will run into the head and create a snowman. Talk to him for the star.

"title": Wall Kicks Will Work
Launch yourself out of the cannon at the tree. Follow the path and use the wall kick technique to reach the star.

"title": Get 100 Coins.

Warp 1a: When you start the level, go around to the right. The warp is on the very end of the broken bridge.
Warp 1b: At the bottom of the level from the pool with the mama penguin in it, go right. The warp is at the very edge of the broken bridge.
Course 5: Big Boo's Haunt

Location: Main floor of castle, open either of the 2 doors with no stars on them. Go down the hall where you see the big ghost. Go into the garden and kill the large ghost. Jump into the cage he drops.
Description: Large haunted house with another building outside.

"title": Go on a Ghost Hunt
Kill all the Boos to make Big Boo appear in the center of the house. Pound him a few times to get a star.

"title": Ride Big Boo's Merry-Go-Round
In the Merry-Go-Round, kill Boos until Big Boo appears. Pound him a few times to get a star.

"title": Secret of the Haunted Books
Upstairs, in the room where the small books fly out at you, there are 3 books sticking out. Hit them in this order: top, right, left.

"title": Seek the 8 Red Coins
Get all 8 Red Coins.

"title": Big Boo's Balcony
Upstairs in the room on the far right, there is a platform up high that you need to jump to. Use the wall kick technique. Go through the double doors near the Blue Coin Box on the ground, and beat the Big Boo outside. The star will appear on the roof. To get the star, you can jump to either of the flat side ledges, then jump to the center ledge with the star. It's not easy.

"title": Eye to Eye in the Secret Room
Get the Vanish Cap, then quickly go up to where the blue star box in the ground is (from Star 5). Instead of going outside, go through the ghost picture on the wall, and beat Mr. I. for the star.

"title": Get 100 Coins.
Course 6: Hazy Maze Cave

Location: Lower floor of castle, from the front of the fire picture, take a right and go through the door with the star on it - pool of metallic liquid

"title": Swimming Beast in the Cavern
On the middle of the island where Dorrie the Sea Dragon is. Run up onto her head, and steer her by moving the control stick.

"title": Elevate for 8 Red Coins
Get all 8 Red Coins.

"title": Metal-Head Mario Can Move
When you take the elevator down to Dorrie's area, get the Metal Cap, then quickly jump on the ! switch under the water. This will open the metal bars guarding the door in front of you. Go in. The star is across a chasm.

"title": Navigating the Toxic Maze
Just before you drop down into the toxic gas area, there is a map on the wall. The down arrow is where you will start; the up arrow is where you can get out. The 3 blue circles are ledges that you can double jump and catch on. Jump up to the one corresponding to the second blue circle from left. The door there will take you up to the star.

"title": A-Maze-Ing Emergency Exit
Same as star 4 except use the blue circle on the far left. You need to jump and travel across the grating to get the star, or just triple jump over to it. There is no door on the ledge corresponding to the blue circle on the right. An alternative method to find these ledges is to pound the Blue Coin Box on the ground and follow the Blue Coins.

"title": Watch for Falling Rocks
Stand under the place where the giant boulders fall down. Look up and towards the door; the star is on the ledge. You can use the wall kick technique to get there.

"title": Get 100 Coins.
Course 7: Lethal Lava Land

Location: Lower floor of castle - picture of fire.

"title": Boil the Big Bully
Knock the Big Bully into the lava. The best way to do this is to stand on the edge and let him run towards you. When he gets close, pound the ground. He will run under you and you should knock him into the fire.

"title": Bully the Bullies
There is an island all the way across the level with 3 Bullies on it. Knock them all into the lava. A Big Bully will appear. Knock him in the lava for the star.

"title": 8-Coin Puzzle with 15 Pieces
Get all 8 Red Coins.

"title": Red-Hot Log Rolling
In one corner of the level, there is a wire fence. Make your way over to it and use the spinning log to get on the island inside the fence. The star is there.

"title": Hot Foot-it into the Volcano
Jump into the volcano in the center of the level. Make your way to the top by running and jumping along the side. The star is at the top.

"title": Inside the Volcano
Jump into the volcano in the center of the level. Jump onto the moving platform and keep riding to the top.

"title": Get 100 Coins.

Warp 1a: From the start of the level, there is an platform behind you across the fire that has a red ! block on it. The warp is in the center of that island.
Warp 1b: There is a platform near where you start with Mr. I. on it. Underneath him is a hole in the grating. The warp is in the hole.
Course 8: Shifting Sand Land

Location: Lower floor of castle, from the front of the fire picture, take a left and go down the hall till you reach a dead end. Jump into the dead end.

"title": In the Talons of the Big Bird
Punch or jump kick Klepto the Condor to get him to drop the star.

"title": Shining Atop the Pyramid
In a crevice on the outside of the pyramid near the top. You can use the Wing Cap to get it or you can just climb up.

"title": Inside the Ancient Pyramid
Inside the pyramid, all the way at the top.

"title": Stand Tall on the Four Pillars
Outside the pyramid, climb up each of the 4 posts that you can walk up. Make sure that you touch the top of each one. After you touch all four, the top of the pyramid will open up. Fly into it, and a cage will bring you down to the red building in the center of the floor. Climb in and beat Eyerok by punching his eyes when they are visible.

"title": Free Flying for 8 Red Coins
Get all 8 Red Coins.

"title": Pyramid Puzzle
Get the 5 special gold coins inside the pyramid. Two of them are on the moving sand bridge, the other 3 are in the center of small square platforms up above the sand bridge.

"title": Get 100 Coins.

Warp 1a: There is a palm tree next to a pool of water near where the vulture is flying. The warp is at the bottom of the tree in the tree's shadow.
Warp 1b: In the corner of the entire level where the cannon is, (on the section with the large cubes), the ground is divided into squares. The warp is in the center of the 4th square down from the cannon. (Stand at the cannon, and face the pyramid, then turn left, then go down 4 squares and stand in the center)
Warp 2a: Inside the pyramid, in the corner of the second floor, there are some Goombas around a pole that goes up to the third floor. After you climb the pole, the warp is in the corner on your right. This takes you above the grating on the second floor where you can get a 1-Up. This is a one-way warp.
Course 9: Dire, Dire Docks

Location: Lower floor of castle, go in the large star door. It's a big wall of water.

"title": Board Bowser's Sub
On the top of the submarine.

"title": Chests in the Current
Swim all the way down when you start the level. There are 4 chests. Open them in this order (if you are at the tunnel looking at the whirlpool): chest on the left, chest on the right, chest in the back, and chest in the front (the one closest to the whirlpool).

"title": Pole-Jumping for Red Coins
Get all 8 Red Coins.

"title": Through the Jet Stream
The jet stream in the room with the submarine will send up rings of water. Swim down through 5 in a row. The star will appear on the ground inside the jet stream. Get the Metal Cap to get the star.

"title": The Manta Ray's Reward
The manta ray will leave rings of water behind him. Swim through five in a row.

"title": Collect the Caps
In the red gate in the water. Get the Vanish Cap, then the the Metal Cap. Jump down in the water and walk through the gate to get the star.

"title": Get 100 Coins.
Course 10: Snowman's Land

Location: Upper floor of castle, in the room with the huge mirror in it. At one end you will see a picture in the mirror that is not there on your side. Jump into that wall where the picture should be.

"title": Snowman's Big Head
Climb up the mountain - jump above where the triangles are coming from, and walk along side of the large penguin to block the snowman's breath, or jump on top of the penguin's head and ride across. The star is at the top.

"title": Chill With the Bully
Knock the Chill Bully off the platform for a star.

"title": In the Deep Freeze
Get the star in the ice block maze near your starting point.

"title": Whirl from the Freezing Pond
There are Spindrifts in the water near the ramp where the triangles come at you... jump on one and spin over to the platform. The left box has the star, the right box contains a turtle shell...

"title": Shell Shreddin' for Red Coins
Get all 8 Red Coins.

"title": Into the Igloo
Use the turtle shell to slide up the ramp with the 3 coins. Crawl into the igloo. Get the Vanish Cap and walk through the walls to get the star in the maze.

"title": Get 100 Coins.

Warp 1a: In the shadow of the tree in the corner of the entire level.
Warp 1b: In the shadow of the tree just before the island with the moving triangles on it.
Course 11: Wet-Dry World

Location: Upper floor of castle - picture of Skeeter (water spider). You can change the water's height by touching the colored spinning diamonds in the course. The starting height of the water is affected by how high you jump into the painting.

"title": Shocking Arrow Lifts!
In the yellow box near the Arrow Lifts.

"title": Top o' the Town
Across the wooden plank, in the yellow box on the highest floating island.

"title": Secrets in the Shallows & Sky
Find all 5 secret spots. One is behind the block that you push at the very bottom of the level, one is in the yellow box that you can get by standing on the block that you push at the very bottom of the level, one is behind the block you push into a hole near one of the Chuckyas, one is in the yellow box above the cage with the star in it, and one is in the yellow box on top of the small island that the bomb is spinning around.

"title": Express Elevator - Hurry Up!

In the cage up high. To get it, you need to lower the water level to the ground. Break the block at the bottom of the cage, climb up so you are on top of the cage with the star, and stand on the left half of the wooden platform. It will fall down. Jump off, run into the cage, and jump back on the platform before it goes up. Inside the cage.

"title": Go to Town for the Red Coins
Get all 8 Red Coins. Use the cannon to launch yourself into the grate in the corner of the level. Swim into the other section of this stage.

"title": Quick Race Through Downtown!
Use the cannon to launch yourself into the grate in the corner of the level, and swim to the other section of this stage. Use the Vanish Cap to get behind the grate near the corner of this section. There is another Vanish Cap inside the grate. Up top is the star. Use the ever-popular wall kick maneuver.

"title": Get 100 Coins.

Warp 1a: The water level must be all the way down in order to use this warp. On the ground there is a white structure made up of 3 steps. On the second step, there is an Amp (spinning ball that will shock you). On the third step there is a diamond that will raise the water level. The warp is on the ground (you will be standing in the water) in the corner of the smallest step and the largest step.
Warp 1b: In the corner on the platform with the cannon. If you are standing on the ramp up to the cannon facing the cannon, the warp is in the farthest corner on the left.
Course 12: Tall, Tall Mountain

Location: Upper floor of castle - small picture of mushroom platforms.

"title": Scale the Mountain
At the very top of the mountain.

"title": Mystery of the Monkey Cage
Catch Ukkiki the Monkey at the very top of the mountain (where Star 1 was) and follow him. He will open the cage with the star.

"title": Scary 'Shrooms, Red Coins
Get all 8 Red Coins.

"title": Mysterious Mountainside
Near the top of the mountain, there will be a wall about the same size as the entrance to Course 8 that you can jump through. When you get near the wall, it will shake. It leads to another slide. Survive the ride all the way to the end for a star.

"title": Breathtaking View from the Bridge
Step on the ! switch near the top of the mountain. This will make a block appear in front of you, and one will appear in front of the waterfall. Go to the waterfall and jump on the block to get the star that is behind the water.

"title": Blast to the Lonely Mushroom
Use the cannon to shoot yourself into the star that is sitting on top of the mushroom platform. The cannon is on a thin ledge beneath the ledge where the Monty Moles are. The Bob-omb Buddy is on a small ledge below where Ukkiki is.

"title": Get 100 Coins.

Warp 1a: In the chasm with the mushroom platforms with the red coins on them, there are 2 very small platforms with no coin on them next to each other. The warp is on the small platform closest to the center of the chasm.
Warp 1b: At the other end of the path with the cannon on this level, there is a square area with a sign on it. The warp is in the corner against the two mountain walls.
Course 13: Tiny-Huge Island

Location: Upper floor of castle, through a door with a star on it - either picture of big and small Goombas (left or right). If you enter the picture on the left, you will be big and the course will be small. If you enter the picture on the right, you will be small and the course will be big. Inside the Course, going down a pipe will change you from big to small, and vice-versa.

"title": Pluck the Piranha Flower
At the green pipe near the flat ! switch that makes a bridge out to the floating island. Make sure you are small. Kill the 5 Piranha Plants and you will get the star.

"title": The Tip Top of the Huge Island
In a yellow box almost at the very top of the mountain. You need to be small to get this.

"title": Rematch with Koopa the Quick
Just past the hole where the black balls roll out of, there is a Koopa the Quick, ready for a rematch. Be small and talk to him. Win the race and you will win a star.

"title": Five Itty Bitty Secrets
Find all 5 secret spots. You have to be big. One is on the cannon, one is in the hole where the balls roll out of, one is the inside of the hole where small Mario can run through to get to the pool, one is in the pool at the very top of the mountain, and one is the the hole in the mountain at the edge of the wooden bridge above the water.

"title": Wiggler's Red Coins
Be small. Launch yourself from the cannon at the tree. To find the Bob-omb Buddy, you need to be big and go to the place where the cannon is. When you catch the tree, climb down and walk across the wooden bridge and into the hole. Get all 8 Red Coins.

"title": Make Wiggler Squirm
Be big. Climb to the pool at the very top of the mountain and pound the center. You will create a hole. Go down and turn small, climb back up, go down the hole, and beat Wiggler.

"title": Get 100 Coins.

Warp 1a: When you are big, there is a ! switch on the ground that will make a temporary bridge appear that will lead out to a square island in the air. In the corner of the island with the gold coin is the warp.
Warp 1b: Unfortunately, this is only a one-way warp... when you take warp 1a, you will appear next to the pipe near the flat ! switch mentioned in warp 1a. So there is really no warp 1b.
Course 14: Tick Tock Clock

Location: Upper floor of castle, up the stairs to the very top section of the castle and go in the door with the huge star on it. Jump in the face of the clock. The lower the number when you enter, the slower the parts inside move. If you enter at any hour exactly on the hour (1 o'clock, 4 o'clock, 12 o'clock, etc.), all the parts will be stopped. You can't get all the stars with the clock stopped, however.

"title": Roll into the Cage
Climb up along the normal path, and you will see the star within some grating. You can jump onto the platforms nearby and get it. Clock may be stopped or moving for this star - easier when stopped.

"title": The Pit and the Pendulums
Climb up farther than star 1, and you will eventually come to a monster who will throw you up. Go past him and jump across the chasm. The star is just ahead. Clock may be stopped or moving for this star - easier when stopped.

"title": Get a Hand
Stand on the clock hand that looks like an arrow and let it swing you around. When you see the star in front of you, jump onto the ledge and get it. Clock must be moving for this star.

"title": Stomp on the Thwomp
Climb up to the very top of the stage. Swing around on the clock hand, and jump onto the Thwomp for the star. Clock must be moving for this star.

"title": Timed Jumps on Moving Bars
Climb up higher than star 1, but not as high as star 4. You will see the star in a cage. You need to stand on top of the cage, then jump onto the platform that comes in and out of the wall to get the star.

"title": Stop Time for Red Coins
Get all 8 Red Coins. Clock may be stopped or moving for this star - easier when stopped.

"title": Get 100 Coins.
Course 15: Rainbow Ride

Location: Upper floor of castle, in the room with Course 14. There are two platforms in the corners of the room. Near them are rooms up high in the wall that you can jump into. One of them is Course 15. The other is a 'secret' level called "Wing Mario over the Rainbow."

"title": Cruiser Crossing the Rainbow
On one end of the pirate ship.

"title": The Big House in the Sky
Ride the carpets up as high as you can go (you will pass through the castle in the sky twice). The star is on top of of the castle in the sky.

"title": Coins Amassed in a Maze
Get all 8 Red Coins.

"title": Swingin' in the Breeze
From the section where there are 4 spinning discs, go towards the tilting bridges and the platforms that swing back and forth. Go across one of the swinging platforms and you should see a flat ! switch on the ground near some triangular blocks. Step on it and the blocks will turn upside down so you can jump on them temporarily. Climb up them for the star.

"title": Tricky Triangles
From the section where there are 4 spinning discs, go towards the tilting bridges and the platforms that swing back and forth. Climb up the steep wood slope, and go across the swinging platform to get the star.

"title": Somewhere over the Rainbow
Launch yourself from the cannon so you catch the large pole coming from the island in the sky. Climb down and the star is in the yellow box. The cannon is on the opposite side of the pirate ship as star 1. To find the Bob-omb Buddy, you need to get on top of the building where all the Red Coins are, and jump down 1 ledge. The best way to get on top of the building where all the Red Coins are is to take the carpet near the 4 spinning discs, and then when it ends, take the carpet on the right. You will jump off it onto the falling wooden blocks, then jump back on it, then jump off it again onto the falling wooden blocks, then back onto it again. You should now be over the building, so you can get off the carpet. There is a yellow box on top of the building for reference.

"title": Get 100 Coins.

Warp 1a: Outside on the edge of the platform leading into the castle up in the sky. (Directly across from the fireplace.)
Warp 1b: In the center on top of the rectangular building with all the Red Coins and the Bob-omb Buddy.
Bowser Courses
Bowser in the Dark World

Location: Main floor of the castle, up the stairs, through the door with the huge star on it. You'll need eight stars to enter, though. There's a trap door in the hallway which takes you to the actual level.

Prize: The first key. It will open the locked door to the lower floor of the castle and gives you access to courses 6-8.

To defeat Bowser: Run around him, pick him up by the tail, and move the analog stick in circles... the faster you swing him, the farther you will throw him. Throw him into a bomb to kill him.

"title": Get all 8 Red Coins.
Bowser in the Fire Sea

Location: Lower floor of the castle, through the door with the huge star on it.

Prize: The second key, which opens the locked door to the upper floor of the castle and gives you access to courses 10-13.

To defeat Bowser: Run around him (easiest after he breathes fire or runs at you), pick him up by the tail, and swing him into one bomb.

"title": Get all 8 Red Coins.
Bowser in the Sky

Location: Upper floor of the castle, up the stairs that lead to the very top, through the star door, and up the final staircase. If you don't have 70 stars, the staircase will go on forever... if you have 70 or more, you will be able to reach the top.

Prize: Beating the game

To defeat Bowser: Run around him (easiest when he throws fire), pick him up by the tail, and swing him into three bombs.

"title": Get all 8 Red Coins.
Switch Courses
Red ! Switch (Wing Cap)

Location: After you get 10 stars, a light will shine down on the main floor where you first enter the castle. There is a large picture of the sun on the ground. Stand anywhere on the picture and look up at the sun. The red ! switch is on the platform in the center of the level.

Description: Gives Mario the power of flight. Start flying by executing a triple jump or by shooting Mario out of a cannon.
Green ! Switch (Metal Cap)

Location: In Course 6, make your way to Dorrie's area. Climb on her head and steer her over to the island where there's red grating on the ground but not blocking the door. Jump off onto the red grating, go through the door, and jump into the pool of metallic liquid. You will be Metal-Cap Mario temporarily which will allow you to walk underwater, and against the current. Hop from island to island and you will see the green ! switch.

Description: Lets Mario walk on the sea floor, but he won't be able to swim. Also, he won't be affected by water or toxic gases.
Blue ! Switch (Vanish Cap)

Location: From the door that leads to Course 6 (facing away from the door), go left, and left again. There should be a door with no star on it. Go in it and you will come to an area with water. There should be 2 small platforms in the water that you can jump on. Pound both of them, and this will drain the moat. Once you have drained the moat, go out the door, and head towards the waterfall. There will be a hole you can fall in. Follow the logical path through this area and you will eventually see the blue ! switch.

Description: Lets Mario walk through wire nets and other special walls. He is invincible to flames and enemies.
Castle Secret Stars

    Princess's Secret Slide - finish the race over 21 seconds.
    Princess's Secret Slide - finish the race under 21 seconds.
    The Secret Aquarium - get all 8 Red Coins.
    After you have 20 stars, catch the MIPS the Rabbit in the lower level of the castle where courses 6-8 are. He will give you a star.
    After you have 20 stars, talk to Toad who is in the room where you enter Course 6. He will give you a star.
    After you have 30 stars, in the upper level of the castle where Courses 10-13 are, Toad will give you a star if you talk to him.
    After you have 50 stars, catch MIPS the Rabbit again for another star.
    After you have 50 stars, in the room with courses 14 and 15, talk to Toad, and he will give you a star.
    Wing Mario over the Rainbow - get all 8 Red Coins.
    Bowser in the Dark World - get all 8 Red Coins.
    Bowser in the Fire Sea - get all 8 Red Coins
    Bowser in the Sky - get all 8 Red Coins
    Green ! Switch level - get all 8 Red Coins
    Vanish Cap Under the Moat (Blue ! Switch level) - get all 8 Red Coins
    Tower of the Wing Cap (Red ! Switch level) - get all 8 Red Coins

Frequenly asked questions
Where are all 15 Castle Secret Stars?

    Finish Princess's Secret Slide over 21.0 seconds
    Finish Princess's Secret Slide under 21.0 seconds
    Get all 8 Red Coins in The Secret Aquarium
    Catch MIPS the Rabbit when you have less than 50 Stars
    Catch MIPS the Rabbit when you have more than 50 Stars
    Talk to Toad by Course 6 entrance
    Talk to Toad on the third floor of the castle
    Talk to Toad on the second floor of the castle
    Get all 8 Red Coins in Tower of the Wing Cap
    Get all 8 Red Coins in the Metal Cap area
    Get all 8 Red Coins in Vanish Cap Under the Moat
    Get all 8 Red Coins in Bowser in the Dark World
    Get all 8 Red Coins in Bowser in the Fire Sea
    Get all 8 Red Coins in Bowser in the Sky
    Get all 8 Red Coins in Wing Mario Over the Rainbow
  